# Data project - Fishing data for Denmark

# TODO
- Import af excel data, formater, kode område navne til ting "man forstår"
- Tilføj kolonne om industri eller konsum
- Tilføj række med priser de enkelte år (MÅSKE til sidst)
- Cirkel diagrammer af hvad vi fanger total og i alle farvande (PLOT ALLE CIRKLER PÅ EN GANG)
- Index kurver og total fangst (DROPDOWN MENUER)
- Vækstrate beregninger (ikke nødvendigt)
- Summerende statistik


Katrine:
Cirkeldiagrammer

Mikkel:
Index kurver og total fangst (med dropdown menuer)

Johannes:
Kolonne som skal fortælle om industri
Søjle/stablet søjle som fortæller  noget om sammensætning af industrik/konsum i farevandet

# Indlæs Data

In [1]:
#First we import relevant packages needed downlaod and open the zipfile
import zipfile
import urllib.request
import shutil
import pandas as pd
import plotly.graph_objs as go
from plotly.offline import plot
import matplotlib.pyplot as plt

#URL (wepbage) and file_name specifies
url = 'http://www.ices.dk/marine-data/Documents/CatchStats/OfficialNominalCatches.zip'
file_name = 'OfficialNominalCatches.zip'

#We "call" the zip-filee from the url by using urllib.request
with urllib.request.urlopen(url) as response, open(file_name, 'wb') as out_file:
    shutil.copyfileobj(response, out_file)
    with zipfile.ZipFile(file_name) as zf:
        zf.extractall()

In [2]:
# Read data from file 'filename.csv' 
# (in the same directory that your python process is based)
# Control delimiters, rows, column names with read_csv (see later) 
data = pd.read_csv("ICESCatchDataset2006-2016.csv") 

# Preview the first 5 lines of the loaded data 
data.head()

,Species,Area,Units,Country,2016,2015,2014,2013,2012,2011,...,Unnamed: 17,Unnamed: 18,Unnamed: 19,Unnamed: 20,Unnamed: 21,Unnamed: 22,Unnamed: 23,Unnamed: 24,Unnamed: 25,Unnamed: 26
0,ANF,27.4,TLW,BE,253.3,200.3,216.9,136.8,132.8,116.4,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,ANF,27.7,TLW,BE,963.4,722.8,491.1,1123.8,1381.5,966.1,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,ANF,27.8,TLW,BE,216.0,181.0,285.4,372.5,201.2,196.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,ANF,27,TLW,BE,1432.7,1104.1,993.4,1633.1,1715.5,1278.5,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,ANF,27.4.a,TLW,BE,0.0,0.0,0.0,0.1,0.0,0.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [3]:
#rename columns to avoid having only numbers
yearDict = {}
for i in range(2006, 2017): # range goes from 2006 to but not including 2017
    yearDict[str(i)] = f'y{i}' 

data.rename(columns = yearDict, inplace=True)
data.head()

,Species,Area,Units,Country,y2016,y2015,y2014,y2013,y2012,y2011,...,Unnamed: 17,Unnamed: 18,Unnamed: 19,Unnamed: 20,Unnamed: 21,Unnamed: 22,Unnamed: 23,Unnamed: 24,Unnamed: 25,Unnamed: 26
0,ANF,27.4,TLW,BE,253.3,200.3,216.9,136.8,132.8,116.4,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,ANF,27.7,TLW,BE,963.4,722.8,491.1,1123.8,1381.5,966.1,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,ANF,27.8,TLW,BE,216.0,181.0,285.4,372.5,201.2,196.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,ANF,27,TLW,BE,1432.7,1104.1,993.4,1633.1,1715.5,1278.5,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,ANF,27.4.a,TLW,BE,0.0,0.0,0.0,0.1,0.0,0.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [6]:
#Drop columns if all values are NaN
data.dropna(axis="columns", how="all", inplace=True)
data.head()

#Drop if countries is different from Denmark
data = data[data['Country']=='DK']

,Species,Area,Units,Country,y2016,y2015,y2014,y2013,y2012,y2011,y2010,y2009,y2008,y2007,y2006
3876,AAS,27.3,TLW,DK,0.00,0.00,0.0,0.23,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3877,AAS,27,TLW,DK,0.03,0.00,0.0,0.23,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3878,AAS,27.3.a,TLW,DK,0.00,0.00,0.0,0.00,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3879,AAS,27.3.c.22,TLW,DK,0.00,0.00,0.0,0.23,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3880,AAS,27.4,TLW,DK,0.03,0.00,0.0,0.00,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3881,AAS,27.4.b,TLW,DK,0.03,0.00,0.0,0.00,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3882,ABK,27.4,TLW,DK,0.03,0.06,0.0,0.00,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3883,ABK,27,TLW,DK,0.03,0.06,0.0,0.00,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3884,ABK,27.4.b,TLW,DK,0.03,0.06,0.0,0.00,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3885,AFT,27.4,TLW,DK,0.00,2.35,0.0,0.00,0.0,0.0,0.0,0.0,0.0,0.0,0.0

## Renaming of fish species

In [7]:
data.loc[data['Species'] == 'BLL', ['Species']] = 'Slethvar'
data.loc[data['Species'] == 'BOR', ['Species']] = 'Havgalt'
data.loc[data['Species'] == 'CAP', ['Species']] = 'Lodde'
data.loc[data['Species'] == 'CAT', ['Species']] = 'Havkat'
data.loc[data['Species'] == 'COD', ['Species']] = 'Torsk'
data.loc[data['Species'] == 'CSH', ['Species']] = 'Hestereje'
data.loc[data['Species'] == 'DAB', ['Species']] = 'Ising'
data.loc[data['Species'] == 'ELE', ['Species']] = 'Blanke/gule ål'
data.loc[data['Species'] == 'FLE', ['Species']] = 'Skrubbe'
data.loc[data['Species'] == 'HAD', ['Species']] = 'Kuller'
data.loc[data['Species'] == 'HER', ['Species']] = 'Sild'
data.loc[data['Species'] == 'HKE', ['Species']] = 'Kulmule'
data.loc[data['Species'] == 'HOM', ['Species']] = 'Hestemakrel'
data.loc[data['Species'] == 'LBE', ['Species']] = 'Alm. hummer'
data.loc[data['Species'] == 'LEM', ['Species']] = 'Rødtunge'
data.loc[data['Species'] == 'LIN', ['Species']] = 'Lange'
data.loc[data['Species'] == 'LUM', ['Species']] = 'Kulso/stenbider'
data.loc[data['Species'] == 'MAC', ['Species']] = 'Makrel'
data.loc[data['Species'] == 'MON', ['Species']] = 'Havtaske'
data.loc[data['Species'] == 'MUS', ['Species']] = 'Blåmusling'
data.loc[data['Species'] == 'NEP', ['Species']] = 'Dybvandhummer'
data.loc[data['Species'] == 'OYF', ['Species']] = 'Østers'
data.loc[data['Species'] == 'PLE', ['Species']] = 'Rødspætte'
data.loc[data['Species'] == 'POK', ['Species']] = 'Mørksej'
data.loc[data['Species'] == 'POL', ['Species']] = 'Lyssej'
data.loc[data['Species'] == 'PRA', ['Species']] = 'Dybvandsrejer'
data.loc[data['Species'] == 'SAL', ['Species']] = 'Laks'
data.loc[data['Species'] == 'SAN', ['Species']] = 'Tobis'
data.loc[data['Species'] == 'SOL', ['Species']] = 'Tunge'
data.loc[data['Species'] == 'SPR', ['Species']] = 'Brisling'
data.loc[data['Species'] == 'TRS', ['Species']] = 'Havørred'
data.loc[data['Species'] == 'TUR', ['Species']] = 'Pighvar'
data.loc[data['Species'] == 'WHB', ['Species']] = 'Blåhvilling'
data.loc[data['Species'] == 'WHG', ['Species']] = 'Hvilling'
data.loc[data['Species'] == 'WIT', ['Species']] = 'Skærising'

data.head()

,Species,Area,Units,Country,y2016,y2015,y2014,y2013,y2012,y2011,y2010,y2009,y2008,y2007,y2006
3876,AAS,27.3,TLW,DK,0.00,0.0,0.0,0.23,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3877,AAS,27,TLW,DK,0.03,0.0,0.0,0.23,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3878,AAS,27.3.a,TLW,DK,0.00,0.0,0.0,0.00,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3879,AAS,27.3.c.22,TLW,DK,0.00,0.0,0.0,0.23,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3880,AAS,27.4,TLW,DK,0.03,0.0,0.0,0.00,0.0,0.0,0.0,0.0,0.0,0.0,0.0

## Dropping of Irrelevant areas and species

In [8]:
data = data.loc[(data['Area'] == '27.4') | (data['Area'] == '27.3.c.22') |(data['Area'] == '27.3.a') | (data['Area'] == '27.3') | (data['Area'] == '27.3.d') | (data['Area'] == '27') ]  

data['SpeciesCount']  = data['Species'].apply(len)

data = data.loc[data['SpeciesCount'] != 3]

data = data.drop(['SpeciesCount'], axis=1)

data.loc[data['Area'] == '27.4', ['Area']] = 'North Sea'
data.loc[data['Area'] == '27.3.c.22', ['Area']] = 'Belt Sea'
data.loc[data['Area'] == '27.3', ['Area']] = 'Skagerak, Kattegat, Sound Belt & Baltic Sea'
data.loc[data['Area'] == '27.3.a', ['Area']] = 'Skagerrak & Kattegat'
data.loc[data['Area'] == '27.3.b', ['Area']] = 'Sound'
data.loc[data['Area'] == '27.3.d', ['Area']] = 'Baltic Sea'
data.loc[data['Area'] == '27', ['Area']] = 'All seas'

,Species,Area,Units,Country,y2016,y2015,y2014,y2013,y2012,y2011,y2010,y2009,y2008,y2007,y2006
3972,Slethvar,27.4,TLW,DK,131.32,122.02,96.41,122.94,126.25,121.98,97.40,96.40,86.00,52.00,75.00
3975,Slethvar,27,TLW,DK,291.49,261.95,180.29,221.92,242.99,276.24,263.31,274.21,317.01,233.02,237.02
3981,Slethvar,27.3.c.22,TLW,DK,27.39,28.54,18.92,23.30,23.88,46.02,65.40,70.30,81.00,51.00,46.00
3982,Slethvar,27.3.d,TLW,DK,0.19,0.33,0.40,0.37,0.35,0.84,1.31,2.21,3.01,2.02,2.02
4005,Havgalt,27,TLW,DK,416.61,28.95,8757.84,13182.14,19882.71,7796.50,39805.20,15078.80,3098.00,0.00,0.00

## Adding column telling if fish is either industry or consumption

In [9]:
#Adding column with type of fish (industry og consumption) based on Species column
def set_type(fish):
    if fish["Species"] == "Tobis":
        return "Industry"
    elif fish["Species"] == "Brisling":
        return "Industry"
    elif fish["Species"] == "Blåhvilling":
        return "Industry"
    elif fish["Species"] == "Hestemakrel":
        return "Industry"
    elif fish["Species"] == "Skolæst":
        return "Industry"
    elif fish["Species"] == "Havgalt":
        return "Industry"
    elif fish["Species"] == "Sperling":
        return "Industry"
    else:
        return "Consumption"
data = data.assign(Type=data.apply(set_type, axis=1))

In [ ]:
#Adding total catches in each water
Total_All=data[data['Area']=='All seas'].sum()['y2016']
Total_North_Sea=data[data['Area']=='North Sea'].sum()['y2016']
Total_Belt_Sea=data[data['Area']=='Belt Sea'].sum()['y2016']
Total_Baltic_Sea=data[data['Area']=='Baltic Sea'].sum()['y2016']
Total_Skagerrak_Kattegat=data[data['Area']=='Skagerrak & Kattegat'].sum()['y2016']
Total_Sound=data[data['Area']=='Skagerak, Kattegat, Sound Belt & Baltic Sea'].sum()['y2016']-Total_Skagerrak_Kattegat-Total_Baltic_Sea
Total_Test=Total_Sound+Total_Skagerrak_Kattegat+Total_Baltic_Sea+Total_Belt_Sea+Total_North_Sea
Total_Unknown=Total_All-Total_Test


print(Total_All)
print(Total_North_Sea)
print(Total_Belt_Sea)
print(Total_Baltic_Sea)
print(Total_Skagerrak_Kattegat)
print(Total_Sound)
print(Total_Unknown)


#Fish caugh in dainish waters by type
Total_All_I=data[(data['Area']=='All seas')&(data['Type']=='Industry')].sum()['y2016']
Total_All_C=data[(data['Area']=='All seas')&(data['Type']=='Consumption')].sum()['y2016']

Total_North_Sea_I=data[(data['Area']=='North Sea')&(data['Type']=='Industry')].sum()['y2016']
Total_North_Sea_C=data[(data['Area']=='North Sea')&(data['Type']=='Consumption')].sum()['y2016']

Total_Belt_Sea_I=data[(data['Area']=='Belt Sea')&(data['Type']=='Industry')].sum()['y2016']
Total_Belt_Sea_C=data[(data['Area']=='Belt Sea')&(data['Type']=='Consumption')].sum()['y2016']

Total_Baltic_Sea_I=data[(data['Area']=='Baltic Sea')&(data['Type']=='Industry')].sum()['y2016']
Total_Baltic_Sea_C=data[(data['Area']=='Baltic Sea')&(data['Type']=='Consumption')].sum()['y2016']

Total_SandK_Sea_I=data[(data['Area']=='Skagerrak & Kattegat')&(data['Type']=='Industry')].sum()['y2016']
Total_SandK_Sea_C=data[(data['Area']=='Skagerrak & Kattegat')&(data['Type']=='Consumption')].sum()['y2016']

Total_Sound_I=data[(data['Area']=='Skagerak, Kattegat, Sound Belt & Baltic Sea')&(data['Type']=='Industry')].sum()['y2016']-Total_SandK_Sea_I-Total_Baltic_Sea_I
Total_Sound_C=data[(data['Area']=='Skagerak, Kattegat, Sound Belt & Baltic Sea')&(data['Type']=='Consumption')].sum()['y2016']-Total_SandK_Sea_C-Total_Baltic_Sea_C

print(Total_All_I)
print(Total_All_C)

print(Total_North_Sea_I)
print(Total_North_Sea_C)

print(Total_Belt_Sea_I)
print(Total_Belt_Sea_C)

print(Total_Baltic_Sea_I)
print(Total_Baltic_Sea_C)

print(Total_SandK_Sea_I)
print(Total_SandK_Sea_C)

print(Total_Sound_I)
print(Total_Sound_C)


#Finding relative ammount of industry and consumption caught in chosen waters

Relative_I_All=Total_All_I/Total_All
Relative_C_All=Total_All_C/Total_All

Relative_I_North_Sea=Total_North_Sea_I/Total_North_Sea
Relative_C_North_Sea=Total_North_Sea_C/Total_North_Sea

Relative_I_Belt_Sea=Total_Belt_Sea_I/Total_Belt_Sea
Relative_C_Belt_Sea=Total_Belt_Sea_C/Total_Belt_Sea

Relative_I_Baltic_Sea=Total_Baltic_Sea_I/Total_Baltic_Sea
Relative_C_Baltic_Sea=Total_Baltic_Sea_C/Total_Baltic_Sea

Relative_I_SandK_Sea=Total_SandK_Sea_I/Total_Skagerrak_Kattegat
Relative_C_SandK_Sea=Total_SandK_Sea_C/Total_Skagerrak_Kattegat

Relative_I_Sound_Sea=Total_Sound_I/Total_Sound
Relative_C_Sound_Sea=Total_Sound_C/Total_Sound

# Interactive index figures of catches and seas

In [ ]:
dataindex = data.loc[data['Area'] == 'All seas'] 
dataindex = dataindex.drop(['Area'], axis=1)
dataindex = dataindex.drop(['Country'], axis=1)
dataindex = dataindex.drop(['Units'], axis=1)
dataindex = dataindex.drop(['Type'], axis=1)

#Drop Lodde and Havgalt because of irregular catch schedules (goes from 0 to 10000-ish between years)
dataindex = dataindex.loc[dataindex['Species'] != 'Lodde']
dataindex = dataindex.loc[dataindex['Species'] != 'Havgalt']

dataindex.set_index('Species', inplace=True)

dataindex = dataindex.iloc[:, ::-1]

dataindex['sum'] = dataindex.sum(axis=1)

largest = dataindex.nlargest(10, ['sum']) 
largest = largest.drop(['sum'], axis=1)


for x in ('y2016','y2015','y2014','y2013','y2012','y2011','y2010','y2009','y2008','y2007','y2006'):
    largest[x] = largest[x]*100/largest['y2006']

largest.columns = largest.columns.str.replace('y', '')

data = [go.Scatter(x=largest.columns,
                   y=largest.loc[Species],
                   name=Species) for Species in largest.index]

layout = go.Layout(
    title='Normalization of catches by species for 10 largest catches, all oceas',
    yaxis=dict(title='2006=100'),
    xaxis=dict(title='Years')
)

fig = go.Figure(data=data, layout=layout)
plot(fig)

# KATRINE

In [ ]:
# include only the area All seas
all_seas = data.copy()
all_seas = all_seas.loc[all_seas['Area'] == 'All seas',:]
all_seas.head()



# Sorted by largest amount catched in 2016
all_seas = all_seas.sort_values(by = ['2016'], ascending=False)


# After top 10, the rest is named Other
#all_seas.loc[all_seas['2016'] < 5000.00, ['Species']] = "Other"

# top 10
top10 = all_seas[:10].copy()

top10.head()

# others
others = pd.DataFrame(data = {
    'Species' : ['Others'],
    '2016' : [all_seas['2016'][10:].sum()]
})

# combining top 10 and others
full = pd.concat([top10, others], sort=False)

# plot
amount_2016 = full['2016']
species_data = full['Species']

colors = ["#1f77b4", "#aec7e8", "#ff7f0e", "#ffbb78",
          "#2ca02c", "#98df8a", "#d62728", "#ff9896",
         "#9467bd", "#c5b0d5", "#7f7f7f"]

plt.pie(amount_2016, labels=species_data, explode=None, colors=colors,
autopct='%1.1f%%', pctdistance=0.7, labeldistance=1.1, shadow=False, startangle=180)

plt.title("Catches in All seas\n"+"...")

plt.show()